# -*- coding: utf-8 -*-

# Создать пакет, в который скопировать функции отрисовки из предыдущего урока
#  - радуги
#  - стены
#  - дерева
#  - смайлика
#  - снежинок
# Функции по модулям разместить по тематике. Название пакета и модулей - по смыслу.
# Создать модуль с функцией отрисовки кирпичного дома с широким окном и крышей.

# С помощью созданного пакета нарисовать эпохальное полотно "Утро в деревне".
# На картине должны быть:
#  - кирпичный дом, в окошке - смайлик.
#  - слева от дома - сугроб (предположим что это ранняя весна)
#  - справа от дома - дерево (можно несколько)
#  - справа в небе - радуга, слева - солнце (весна же!)
# пример см. lesson_005/results/04_painting.jpg
# Приправить своей фантазией по вкусу (коты? коровы? люди? трактор? что придумается)

import simple_draw as sd
import func_draw.rainbow as rb
import func_draw.house as hs
import func_draw.tree as tr
import func_draw.smile as sm

sd.resolution = (1200, 600)


# радуга
rb_point_centr = sd.get_point(300, -450)
rb_start_radius = 1100
rb_line_width = 10

rb.draw_rainbow(rb_point_centr, rb_start_radius, rb_line_width)

# стена
hs.draw_house()

# дерево
root_point = sd.get_point(900, 0)
tr.draw_branches(start_point=root_point, angle=90, branches_length=50)


# смайл
sm.draw_smile(1150, 150, sd.COLOR_CYAN)

sd.pause()

# Усложненное задание (делать по желанию)
# Анимировать картину.
# Пусть слева идет снегопад, радуга переливается цветами, смайлик моргает, солнце крутит лучами, етс.
# Задержку в анимировании все равно надо ставить, пусть даже 0.01 сек - так библиотека устойчивей работает.
