# -*- coding: utf-8 -*-

# Создать модуль my_burger. В нем определить функции добавления инградиентов:
#  - булочки
#  - котлеты
#  - огурчика
#  - помидорчика
#  - майонеза
#  - сыра
# В каждой функции выводить на консоль что-то вроде "А теперь добавим ..."

def dob_bulochka():
    print('А теперь добавим булочку')


def dob_katleta():
    print('А теперь добавим котлету')


def dob_ogurec():
    print('А теперь добавим огурчик')


def dob_tomato():
    print('А теперь добавим помидорчик')


def dob_mazik():
    print('А теперь добавим мойонез')


def dob_chizz():
    print('А теперь добавим сыр')
